In [1]:
import pandas as pd

In [6]:
# Series datastructure(1D array with labels)in pandas it is similar to dictionary in python 
#it automatically gives labels (index) to data
s1=pd.Series([10,21,33,87,54])

In [7]:
s1

0    10
1    21
2    33
3    87
4    54
dtype: int64

In [11]:
# for giveing our own index
s2=pd.Series([77,81,73,87,84],index=["suraj","aditya","Om","swami","kunal"])

In [12]:
s2

suraj     77
aditya    81
Om        73
swami     87
kunal     84
dtype: int64

In [14]:
#Dataframe datastructure (2D array with label ) in pandas its like Excel data
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [16]:
df=pd.DataFrame(data)

In [17]:
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
df.columns

Index(['name', 'age', 'city'], dtype='object')